app/Http/Controllers/AdController.php

    public function index(Request $request,$regionSlug = null, $departementCode = null, $communeCode = null)
    {

        $categories = Category::select('name','id')->oldest('name')->get();

        $regions = Region::select('id','code','name','slug')->oldest('name')->get();

        $region = $regionSlug ? Region::whereSlug($regionSlug)->firstOrFail() : null;
---
select `name`, `id` from `categories` order by `name` asc
select `id`, `code`, `name`, `slug` from `regions` order by `name` asc
select * from `regions` where `slug` = 'normandie' limit 1

    public function create(Request $request)
    {
        if(!$request->session()->has('index')) {
            $request->session()->put('index', Str::random(30));
        }
        $categories = Category::select('name', 'id')->oldest('name')->get();
        $regions = Region::oldest('name')->get();
---
select `name`, `id` from `categories` order by `name` asc
select * from `regions` order by `name` asc

    public function store(AdStore $request)
    {
        $commune = json_decode(file_get_contents('https://geo.api.gouv.fr/communes/' . $request->commune), true);
        $ad = $this->adRepository->create([
            'title' => $request->title,
            'texte' => $request->texte,
            'category_id' => $request->category,
            'region_id' => $request->region,
            'departement' => $request->departement,
            'commune' => $request->commune,
            'commune_name' => $commune['nom'],
            'commune_postal' => $commune['codesPostaux'][0],
            'user_id' => auth()->check() ? auth()->id() : 0,
            'pseudo' => auth()->check() ? auth()->user()->name :$request->pseudo,
            'email' => auth()->check() ? auth()->user()->email : $request->email,
            'limit' => Carbon::now()->addWeeks($request->limit),
        ]);
        if($request->session()->has('index')) {
            $index = $request->session()->get('index');
            Upload::whereIndex($index)->update(['ad_id' => $ad->id, 'index' => 0]);
---
update `uploads` set `ad_id` = 42, `index` = 0, `uploads`.`updated_at` = '2019-05-06 13:39:16' where `index` = 'to9A8gOL9o2tmQRm70XrvcqeIm6YOw'