app/Http/Controllers/UploadImagesController.php

    public function getServerImages(Request $request)
    {
        if($request->session()->has('index')) {
            $imageAnswer = [];
            $index = $request->session()->get('index');
            $images = Upload::whereIndex($index)->get();
---
select * from `uploads` where `index` = 'FePoO3hde6ZijWGoWTByDJHZV8IApp'

    public function destroy(Request $request)
    {
        $uploaded_image = Upload::where('original_name', basename($request->name))->first();
---
select * from `uploads` where `original_name` = 'presta1.jpg' limit 1